In [800]:
import pandas as pd
import numpy as np
from sqlalchemy import create_engine
import sys

In [622]:
import pymysql
pymysql.install_as_MySQLdb()
db = pymysql.connect(host="localhost",    
                     user="root",        
                     passwd="", 
                     
db="mini") 
cur = db.cursor()

In [769]:
user=sys.argv[1]

In [770]:
sql = "SELECT user_id ,isbn,rating FROM rating where user_id = %d order by rating desc" % (user)
cur.execute(sql)
db.commit()
results = cur.fetchall()
results=list(results)
data2=pd.DataFrame(results)

In [771]:
data2.head()

     0         1  2
0  675  10000054  9
1  675  10000441  9
2  675  10000062  9
3  675  10000788  9
4  675  10000230  9

In [772]:
selected=data2.iloc[0:3:,:]

In [773]:
selected

     0         1  2
0  675  10000054  9
1  675  10000441  9
2  675  10000062  9

In [774]:
selected_books=selected[1].tolist()

In [775]:
selected_books

[10000054, 10000441, 10000062]

In [776]:
selected_rating=selected[2].tolist()

In [777]:
selected_rating

[9, 9, 9]

In [778]:
sql = "SELECT user_id ,isbn,rating FROM rating where isbn = %d " % (selected_books[0])
cur.execute(sql)
db.commit()
results = cur.fetchall()
results=list(results)
r1=pd.DataFrame(results)

In [779]:
sql = "SELECT user_id ,isbn,rating FROM rating where isbn = %d " % (selected_books[1])
cur.execute(sql)
db.commit()
results = cur.fetchall()
results=list(results)
r2=pd.DataFrame(results)

In [780]:
sql = "SELECT user_id ,isbn,rating FROM rating where isbn = %d " % (selected_books[2])
cur.execute(sql)
db.commit()
results = cur.fetchall()
results=list(results)
r3=pd.DataFrame(results)

In [781]:
r1.head()

     0         1  2
0  847  10000054  4
1  241  10000054  9
2  762  10000054  2
3  432  10000054  4
4  240  10000054  3

In [782]:
r2.head()

     0         1  2
0  493  10000441  2
1  980  10000441  9
2  687  10000441  2
3  360  10000441  9
4   62  10000441  6

In [783]:
common_user=list(set(r1[0]) & set(r2[0]) )

In [784]:
common_user

[385, 2, 675, 110, 189, 413]

In [785]:
common_user.remove(user)

In [786]:
selected_rating

[9, 9, 9]

In [787]:
distance=[]
for i in range(len(common_user)):
    u1=r1[r1[0]==common_user[i]]
    u2=r2[r2[0]==common_user[i]]
   
    u1=u1[2].tolist()
    u2=u2[2].tolist()
   
    ans=0
    ans=(selected_rating[0]-u1[0])**2 + (selected_rating[1]-u2[0])**2 
    ans=np.sqrt(ans)
    distance.append(ans)

In [788]:
def find_min_index(a):
    if len(a)==0:
        return 0
    minimum=min(a)
    for i in range(len(a)) :
        if a[i]==minimum :
            return i

In [789]:
if len(common_user)==0:
    nearest_user=0
else :
    nearest_user=common_user[find_min_index(distance)]
nearest_user

385

In [790]:
sql = "SELECT user_id ,isbn,rating FROM rating where user_id = %d and isbn != %d AND isbn != %d order by rating Desc limit 7" % (nearest_user,selected_books[0],selected_books[1])
cur.execute(sql)
db.commit()
results = cur.fetchall()
results=list(results)
r4=pd.DataFrame(results)

In [791]:
cur.execute("drop table recommend")

0

In [792]:
cur.execute("create table recommend (id int, isbn_ varchar(200),rating int)")

0

In [793]:
db.commit()

In [794]:
engine = create_engine("mysql://root:@localhost/mini")

In [795]:
r4.columns=["id","isbn_","rating"]

In [796]:
r4.to_sql("recommend",con=engine,if_exists='append',index=False)

In [798]:
sql='call class()'

cur.execute(sql)
db.commit()
results = cur.fetchall()
results=list(results)
cursorout=pd.DataFrame(results)

In [799]:
cursorout

        0
0  Expert